import React from "react";
import "./Intro.css";
import Wall1 from "../../assets/images/one.jpg";
import Wall2 from "../../assets/images/two.jpg";
const Intro = (props) => {
  return (
    <>
      <div className="intro">
        <img src={Wall1} />
        <span>01</span>
        <div>
          <h1>یک تغییر فوق العاده</h1>
          <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشت.</p>
        </div>
      </div>
      <div className="introleft">
        <img src={Wall2} />
        <span>02</span>
        <div>
          <h1>یک تغییر فوق العاده</h1>
          <p>لورم ایپسوم متن ساختگی با تولید سادگی نامفهوم از صنعت چاپ و با استفاده از طراحان گرافیک است. چاپگرها و متون بلکه روزنامه و مجله در ستون و سطرآنچنان که لازم است و برای شرایط فعلی تکنولوژی مورد نیاز و کاربردهای متنوع با هدف بهبود ابزارهای کاربردی می باشد. کتابهای زیادی در شصت و سه درصد گذشت.</p>
        </div>
      </div>
    </>
  );
};

export default Intro;
